In [1]:
import pandas as pd
from sqlalchemy import create_engine
import re

In [2]:
sqlitedb_path = '../data/raw/veronicamg.db'

In [3]:
engine = create_engine(f'sqlite:///{sqlitedb_path}')

In [4]:
engine.table_names()

['business_info', 'personal_info', 'rank_info']

In [5]:
df_business_info = pd.read_sql_query("select * from business_info", engine)

df_business_info.head()

,id,Unnamed: 0,Source,worth,worthChange,realTimeWorth,realTimePosition
0,1014,52,Technology ==> Amazon,112.0 BUSD,0.0 millions USD,None,1
1,1305,53,Technology ==> Microsoft,90.0 BUSD,-0.001 millions USD,None,2
2,3988,54,Finance and Investments ==> Berkshire Hathaway,84.0 BUSD,-0.002 millions USD,None,3
3,9380,55,Fashion & Retail ==> LVMH,72.0 BUSD,0.0 millions USD,None,4
4,4001,56,Technology ==> Facebook,71.0 BUSD,0.0 millions USD,None,5

In [6]:
df_business_info.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2208 entries, 0 to 2207
Data columns (total 7 columns):
id                  2208 non-null int64
Unnamed: 0          2208 non-null int64
Source              2208 non-null object
worth               2208 non-null object
worthChange         2208 non-null object
realTimeWorth       0 non-null object
realTimePosition    2208 non-null int64
dtypes: int64(3), object(4)
memory usage: 120.9+ KB

In [7]:
df_business_info.isnull().sum()

id                     0
Unnamed: 0             0
Source                 0
worth                  0
worthChange            0
realTimeWorth       2208
realTimePosition       0
dtype: int64

In [8]:
df_business_info_2 = df_business_info[['id','Unnamed: 0','Source','worth','worthChange','realTimePosition']]

In [9]:
df_personal_info = pd.read_sql_query("select * from personal_info", engine)

df_personal_info.head()

,id,lastName,age,Unnamed: 0,gender,country,image
0,1014,bEZOs,54 years old,52,None,United States,https://specials-images.forbesimg.com/imageser...
1,1305,gaTEs,62 years old,53,Male,USA,https://specials-images.forbesimg.com/imageser...
2,3988,bufFETt,87 years old,54,M,United States,https://specials-images.forbesimg.com/imageser...
3,9380,aRNAUlt,69 years old,55,None,None,https://specials-images.forbesimg.com/imageser...
4,4001,zucKERBERg,1985,56,M,United States,https://specials-images.forbesimg.com/imageser...

In [10]:
df_personal_info.isnull().sum()

id             0
lastName       0
age           65
Unnamed: 0     0
gender        13
country        0
image          0
dtype: int64

In [11]:
df_rank_info = pd.read_sql_query("select * from rank_info", engine)

df_rank_info.head()

     id                         name  position  Unnamed: 0
0  9036  anant ASAVABHOKHIN & FAMILY       NaN           0
1  4048               aRASH FERdowsi       NaN           1
2  7384     banthoon LAMSAM & FAMILy       NaN           2
3  9738       bill adDERLEY & family       NaN           3
4  5623            boris zINGARevich       NaN           4

In [12]:
df_business_personal = pd.merge(df_business_info_2, df_personal_info, on='Unnamed: 0')
df_business_personal.head()

,id_x,Unnamed: 0,Source,worth,worthChange,realTimePosition,id_y,lastName,age,gender,country,image
0,1014,52,Technology ==> Amazon,112.0 BUSD,0.0 millions USD,1,1014,bEZOs,54 years old,None,United States,https://specials-images.forbesimg.com/imageser...
1,1305,53,Technology ==> Microsoft,90.0 BUSD,-0.001 millions USD,2,1305,gaTEs,62 years old,Male,USA,https://specials-images.forbesimg.com/imageser...
2,3988,54,Finance and Investments ==> Berkshire Hathaway,84.0 BUSD,-0.002 millions USD,3,3988,bufFETt,87 years old,M,United States,https://specials-images.forbesimg.com/imageser...
3,9380,55,Fashion & Retail ==> LVMH,72.0 BUSD,0.0 millions USD,4,9380,aRNAUlt,69 years old,None,None,https://specials-images.forbesimg.com/imageser...
4,4001,56,Technology ==> Facebook,71.0 BUSD,0.0 millions USD,5,4001,zucKERBERg,1985,M,United States,https://specials-images.forbesimg.com/imageser...

In [13]:
df_merged = pd.merge(df_business_personal, df_rank_info, on='Unnamed: 0')
df_merged.head()

,id_x,Unnamed: 0,Source,worth,worthChange,realTimePosition,id_y,lastName,age,gender,country,image,id,name,position
0,1014,52,Technology ==> Amazon,112.0 BUSD,0.0 millions USD,1,1014,bEZOs,54 years old,None,United States,https://specials-images.forbesimg.com/imageser...,1014,JEFF BEZOs,1.0
1,1305,53,Technology ==> Microsoft,90.0 BUSD,-0.001 millions USD,2,1305,gaTEs,62 years old,Male,USA,https://specials-images.forbesimg.com/imageser...,1305,bilL GAtes,2.0
2,3988,54,Finance and Investments ==> Berkshire Hathaway,84.0 BUSD,-0.002 millions USD,3,3988,bufFETt,87 years old,M,United States,https://specials-images.forbesimg.com/imageser...,3988,wARREN BUFFett,3.0
3,9380,55,Fashion & Retail ==> LVMH,72.0 BUSD,0.0 millions USD,4,9380,aRNAUlt,69 years old,None,None,https://specials-images.forbesimg.com/imageser...,9380,bERNARD ARnault,4.0
4,4001,56,Technology ==> Facebook,71.0 BUSD,0.0 millions USD,5,4001,zucKERBERg,1985,M,United States,https://specials-images.forbesimg.com/imageser...,4001,mark zUCKERBERG,5.0

In [14]:
df_merged.drop(columns=['id_x', 'id_y'], inplace = True)

In [15]:
null_cols = df_merged.isnull().sum()

null_cols[null_cols > 0]

null_cols[null_cols > 0] / len(df_merged) * 100

age       2.943841
gender    0.588768
dtype: float64

In [16]:
#As the percentage of null values is quite low I am not going to transform the null values.

"""SOURCE COLUMN --> I'm going to split the 'Source' column in two columns:
- Comnpany Sector
- Company Name"""

In [17]:
def clean_source (s):
    return s.split('  ==> ')

In [18]:
df_merged['Source'] = df_merged['Source'].apply(clean_source)

In [19]:
df_merged['company_name'] = df_merged['Source'].apply(lambda x : x[1:])
df_merged['company_name'] = df_merged['company_name'].apply(lambda x : x[0])
df_merged['company_sector'] = df_merged['Source'].apply(lambda x : x[:1])
df_merged['company_sector'] = df_merged['company_sector'].apply(lambda x : x[0])

In [20]:
df_merged.drop(columns = ['Source'], inplace = True)
df_merged.head()

,Unnamed: 0,worth,worthChange,realTimePosition,lastName,age,gender,country,image,id,name,position,company_name,company_sector
0,52,112.0 BUSD,0.0 millions USD,1,bEZOs,54 years old,None,United States,https://specials-images.forbesimg.com/imageser...,1014,JEFF BEZOs,1.0,Amazon,Technology
1,53,90.0 BUSD,-0.001 millions USD,2,gaTEs,62 years old,Male,USA,https://specials-images.forbesimg.com/imageser...,1305,bilL GAtes,2.0,Microsoft,Technology
2,54,84.0 BUSD,-0.002 millions USD,3,bufFETt,87 years old,M,United States,https://specials-images.forbesimg.com/imageser...,3988,wARREN BUFFett,3.0,Berkshire Hathaway,Finance and Investments
3,55,72.0 BUSD,0.0 millions USD,4,aRNAUlt,69 years old,None,None,https://specials-images.forbesimg.com/imageser...,9380,bERNARD ARnault,4.0,LVMH,Fashion & Retail
4,56,71.0 BUSD,0.0 millions USD,5,zucKERBERg,1985,M,United States,https://specials-images.forbesimg.com/imageser...,4001,mark zUCKERBERG,5.0,Facebook,Technology

"""WORTH COLUMN --> I'm going to change the type of the worth column from object type to float type"""

In [21]:
#First let's see if all quantities are expressed in the same unit of measure and in the same currency.
df_merged['worth'] = df_merged['worth'].apply(lambda x : x.split(' '))
df_merged['worth_unit'] = df_merged['worth'].apply(lambda x : x[1:])
df_merged['worth_unit'] = df_merged['worth_unit'].apply(lambda x : x[0])
df_merged.worth_unit.unique()

array(['BUSD'], dtype=object)

In [22]:
"""Now that we know that all the amounts are in the same unit and in the same currency, 
let's change the type of values in the column."""
df_merged["worth_amount_(BUSD)"] = df_merged['worth'].apply(lambda x : x[:1])
df_merged["worth_amount_(BUSD)"] = df_merged["worth_amount_(BUSD)"].apply(lambda x : x[0])
df_merged["worth_amount_(BUSD)"] = df_merged["worth_amount_(BUSD)"].astype(float)

In [23]:
df_merged.drop(columns = ['worth_unit','worth'], inplace = True)
df_merged.head()

,Unnamed: 0,worthChange,realTimePosition,lastName,age,gender,country,image,id,name,position,company_name,company_sector,worth_amount_(BUSD)
0,52,0.0 millions USD,1,bEZOs,54 years old,None,United States,https://specials-images.forbesimg.com/imageser...,1014,JEFF BEZOs,1.0,Amazon,Technology,112.0
1,53,-0.001 millions USD,2,gaTEs,62 years old,Male,USA,https://specials-images.forbesimg.com/imageser...,1305,bilL GAtes,2.0,Microsoft,Technology,90.0
2,54,-0.002 millions USD,3,bufFETt,87 years old,M,United States,https://specials-images.forbesimg.com/imageser...,3988,wARREN BUFFett,3.0,Berkshire Hathaway,Finance and Investments,84.0
3,55,0.0 millions USD,4,aRNAUlt,69 years old,None,None,https://specials-images.forbesimg.com/imageser...,9380,bERNARD ARnault,4.0,LVMH,Fashion & Retail,72.0
4,56,0.0 millions USD,5,zucKERBERg,1985,M,United States,https://specials-images.forbesimg.com/imageser...,4001,mark zUCKERBERG,5.0,Facebook,Technology,71.0

"""AGE COLUMN --> I'm going to change the type of the age column from object type to float type."""

In [24]:
#Let's see if the format is the same in all records.
df_merged.age.unique()

array(['54 years old', '62 years old', '87 years old', '69 years old',
       '1985', '82 years old', '78 years old', '73 years old',
       '76 years old', '45 years old', '44 years old', '70 years old',
       '68 years old', '46 years old', '64 years old', '61 years old',
       '53 years old', '84 years old', '90 years old', '59 years old',
       '63 years old', '66 years old', '80 years old', '81 years old',
       '56 years old', '79 years old', '74 years old', '60 years old',
       '93 years old', '52 years old', '1983', '65 years old',
       '83 years old', '67 years old', '75 years old', '89 years old',
       None, '72 years old', '48 years old', '77 years old',
       '86 years old', '57 years old', '1988', '55 years old',
       '94 years old', '47 years old', '71 years old', '92 years old',
       '88 years old', '85 years old', '49 years old', '51 years old',
       '50 years old', '43 years old', '42 years old', '91 years old',
       '58 years old', '1984', '38 years old', '1982', '95 years old',
       '39 years old', '41 years old', '40 years old', '1990', '1991',
       '97 years old', '1986', '99 years old', '1994', '1998', '1996',
       '96 years old', '1987', '1989', '1992'], dtype=object)

In [25]:
#Let's create a function to change the data type.
def change_age(age):
    if age == None:
        return None
    elif re.search('years old', age) is not None:
        num = re.sub('[a-zA-Z ]', '', age)
        return int(num)
    else:
        year = int(age)
        age_2018 = 2018 - year
        return int(age_2018)

In [26]:
#Now, let's apply the function to the column 'age'.
df_merged['age'] = df_merged['age'].apply(change_age)
df_merged.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 2208 entries, 0 to 2207
Data columns (total 14 columns):
Unnamed: 0             2208 non-null int64
worthChange            2208 non-null object
realTimePosition       2208 non-null int64
lastName               2208 non-null object
age                    2143 non-null float64
gender                 2195 non-null object
country                2208 non-null object
image                  2208 non-null object
id                     2208 non-null int64
name                   2208 non-null object
position               2208 non-null float64
company_name           2208 non-null object
company_sector         2208 non-null object
worth_amount_(BUSD)    2208 non-null float64
dtypes: float64(3), int64(3), object(8)
memory usage: 258.8+ KB

"""COUNTRY COLUMN --> I'm going to standardize the the name of the countries listed in the column."""

In [27]:
#Let's see the unique values
df_merged.country.unique()

array(['United States', 'USA', 'None', 'China', 'Hong Kong', 'Germany',
       'Brazil', 'France', 'Austria', 'Japan',
       "People's Republic of China", 'Russia', 'South Korea', 'Thailand',
       'Ireland', 'Indonesia', 'Australia', 'Sweden', 'United Kingdom',
       'Netherlands', 'Malaysia', 'India', 'Nigeria', 'Mexico', 'Canada',
       'Italy', 'Taiwan', 'South Africa', 'Singapore', 'Norway',
       'Belgium', 'United Arab Emirates', 'Philippines', 'Israel',
       'Switzerland', 'UK', 'Denmark', 'Portugal', 'Turkey', 'Georgia',
       'Venezuela', 'Swaziland', 'Oman', 'Poland', 'Chile', 'Cyprus',
       'Vietnam', 'Spain', 'Czech Republic', 'UAE', 'Lebanon',
       'Kazakhstan', 'Morocco', 'Monaco', 'Finland', 'Iceland', 'Egypt',
       'Peru', 'Argentina', 'St. Kitts and Nevis', 'Ukraine', 'Nepal',
       'Kuwait', 'Zimbabwe', 'Qatar'], dtype=object)

In [28]:
#Let's create a function to standardize the name of the countries.
def country_clean(country):
    if country is None:
        return None 
    elif re.search('USA', country) is not None:
        return 'United States'
    elif re.search('China', country) is not None:
        return 'China'
    elif re.search('UK', country) is not None:
        return 'United Kingdom'
    elif re.search('UAE', country) is not None:
        return 'United Arab Emirates'
    elif re.search('None', country) is not None:
        return None
    else:
        return country

In [29]:
#Now, let's apply the function to the column 'age'.
df_merged['country'] = df_merged['country'].apply(country_clean)

In [30]:
df_merged.country.unique()

array(['United States', None, 'China', 'Hong Kong', 'Germany', 'Brazil',
       'France', 'Austria', 'Japan', 'Russia', 'South Korea', 'Thailand',
       'Ireland', 'Indonesia', 'Australia', 'Sweden', 'United Kingdom',
       'Netherlands', 'Malaysia', 'India', 'Nigeria', 'Mexico', 'Canada',
       'Italy', 'Taiwan', 'South Africa', 'Singapore', 'Norway',
       'Belgium', 'United Arab Emirates', 'Philippines', 'Israel',
       'Switzerland', 'Denmark', 'Portugal', 'Turkey', 'Georgia',
       'Venezuela', 'Swaziland', 'Oman', 'Poland', 'Chile', 'Cyprus',
       'Vietnam', 'Spain', 'Czech Republic', 'Lebanon', 'Kazakhstan',
       'Morocco', 'Monaco', 'Finland', 'Iceland', 'Egypt', 'Peru',
       'Argentina', 'St. Kitts and Nevis', 'Ukraine', 'Nepal', 'Kuwait',
       'Zimbabwe', 'Qatar'], dtype=object)

In [31]:
null_cols = df_merged.isnull().sum()

null_cols[null_cols > 0]

null_cols[null_cols > 0] / len(df_merged) * 100

age         2.943841
gender      0.588768
country    60.190217
dtype: float64

In [32]:
def capitalize(name):
    return name.title()

In [33]:
df_merged['name'] = df_merged['name'].apply(capitalize)
df_merged['lastName'] = df_merged['lastName'].apply(capitalize)

In [34]:
df_merged.head()

,Unnamed: 0,worthChange,realTimePosition,lastName,age,gender,country,image,id,name,position,company_name,company_sector,worth_amount_(BUSD)
0,52,0.0 millions USD,1,Bezos,54.0,None,United States,https://specials-images.forbesimg.com/imageser...,1014,Jeff Bezos,1.0,Amazon,Technology,112.0
1,53,-0.001 millions USD,2,Gates,62.0,Male,United States,https://specials-images.forbesimg.com/imageser...,1305,Bill Gates,2.0,Microsoft,Technology,90.0
2,54,-0.002 millions USD,3,Buffett,87.0,M,United States,https://specials-images.forbesimg.com/imageser...,3988,Warren Buffett,3.0,Berkshire Hathaway,Finance and Investments,84.0
3,55,0.0 millions USD,4,Arnault,69.0,None,None,https://specials-images.forbesimg.com/imageser...,9380,Bernard Arnault,4.0,LVMH,Fashion & Retail,72.0
4,56,0.0 millions USD,5,Zuckerberg,33.0,M,United States,https://specials-images.forbesimg.com/imageser...,4001,Mark Zuckerberg,5.0,Facebook,Technology,71.0

In [35]:
df_merged['gender'].unique()

array(['None', 'Male', 'M', 'Female', 'F', None], dtype=object)

In [36]:
def gender_clean(gender):
    if gender is None:
        return None 
    elif re.search('Male', gender) is not None:
        return 'M'
    elif re.search('Female', gender) is not None:
        return 'F'
    elif re.search('None', gender) is not None:
        return None
    else:
        return gender

In [37]:
df_merged['gender'] = df_merged['gender'].apply(gender_clean)
df_merged['gender'].unique()

array([None, 'M', 'F'], dtype=object)

In [38]:
null_cols = df_merged.isnull().sum()

null_cols[null_cols > 0]

null_cols[null_cols > 0] / len(df_merged) * 100

age         2.943841
gender     25.407609
country    60.190217
dtype: float64

In [39]:
columns = ['name', 'worth_amount_(BUSD)', 'country', 'company_sector', 'company_name', 'age', 'gender']
df_cleaned = df_merged[columns]

In [40]:
df_cleaned.to_csv(f'../data/processed/cleaned_data.csv')